app/controllers/elections_controller.rb

    def index
        @elections = Election.all
---
SELECT "elections".* FROM "elections"