app/controllers/follows_controller.rb

SELECT "follows".* FROM "follows"
---
    def index
        @follows = Follow.all

INSERT INTO "follows" ("user_id", "election_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["election_id", 2], ["created_at", "2020-06-15 23:34:21.670263"], ["updated_at", "2020-06-15 23:34:21.670263"]]
---
    def create
        user_id = @user.id
        election_id = params[:follow][:election_id]
        @follow = Follow.create(user_id: user_id, election_id: election_id)

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 10]]
---
    def destroy
        @follow.destroy

SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = $1 AND "follows"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 10], ["LIMIT", 1]]
---
    def set_follow
        @follow = @user.follows.find(params[:id])