app/controllers/users_controller.rb

    def create
        api_key = ENV['google_api_key']
        hometowns = RestClient.get "https://www.googleapis.com/civicinfo/v2/voterinfo?key=#{api_key}&address=#{params["line1"]}%20#{params["city"]}%20#{params["state"]}%20#{params["zip_code"]}&electionId=2000"
        results = JSON.parse(hometowns)
        polling_addresses = results["pollingLocations"][0]["address"].to_json
        @hometown = Hometown.find_or_create_by(pollingLocations: polling_addresses)
        @user = User.create(
            name: params["name"],
            email: params["email"],
            password: params["password"],
            line1: params["line1"],
            city: params["city"],
            state: params["state"],
            zip_code: params["zip_code"],
            hometown_id: @hometown.id
        )
---
INSERT INTO "hometowns" ("pollingLocations", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
SELECT "hometowns".* FROM "hometowns" WHERE "hometowns"."pollingLocations" = $1 LIMIT $2  [["pollingLocations", "{\"locationName\":\"PS 234 (Independence)\",\"line1\":\"292 Greenwich Street\",\"city\":\"New York\",\"state\":\"NY\",\"zip\":\"10007\"}"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "line1", "city", "state", "zip_code", "hometown_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
        @user.update(user_params)
        @user.update_hometown
---
UPDATE "users" SET "name" = $1, "email" = $2, "line1" = $3, "zip_code" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", "Lucy"], ["email", "lucyliu@gmail.com"], ["line1", "101 W 15th Street"], ["zip_code", "10011"], ["updated_at", "2020-06-18 20:37:54.742296"], ["id", 1]]
UPDATE "users" SET "email" = $1, "line1" = $2, "city" = $3, "state" = $4, "zip_code" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["email", "stephzou@gmail.com"], ["line1", "1263 Pacific Ave"], ["city", "Kansas City"], ["state", "KS"], ["zip_code", "66102"], ["updated_at", "2020-06-16 19:57:21.399575"], ["id", 1]]

    def send_text
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]