app/models/user.rb

    def update_hometown
        api_key = ENV['google_api_key']
        hometowns = RestClient.get "https://www.googleapis.com/civicinfo/v2/voterinfo?key=#{api_key}&address=#{self.line1}%20#{self.city}%20#{self.state}%20#{self.zip_code}&electionId=2000"
            results = JSON.parse(hometowns)
        if results["pollingLocations"]
            polling_addresses = results["pollingLocations"][0]["address"].to_json
            @hometown = Hometown.find_or_create_by(pollingLocations: polling_addresses)
        else
            @hometown = Hometown.first
        end
        self.update(hometown: @hometown)
---
INSERT INTO "hometowns" ("pollingLocations", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
SELECT "hometowns".* FROM "hometowns" WHERE "hometowns"."pollingLocations" = $1 LIMIT $2  [["pollingLocations", "{\"locationName\":\"Associated Blind\",\"line1\":\"135 West 23 Street\",\"city\":\"New York\",\"state\":\"NY\",\"zip\":\"10011\"}"], ["LIMIT", 1]]
UPDATE "users" SET "hometown_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["hometown_id", 2], ["updated_at", "2020-06-18 15:20:29.510210"], ["id", 1]]